tools/аудиты/фикстуры/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

tools/аудиты/фикстуры/AccumulationRegisters/УЗ_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

tools/аудиты/фикстуры/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

tools/аудиты/фикстуры/Documents/УЗ_ПриходДенег/Ext/ObjectModule.bsl
// Фикстура аудитов: чистый модуль. Здесь нарочно собраны законные конструкции,
// похожие на нарушения, — на них аудиты обязаны молчать.
// ОбщегоНазначения.СообщитьПользователю("вызов БСП в комментарии не считается");

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.УЗ_Касса.Записывать = Истина;
	Движение = Движения.УЗ_Касса.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Касса = Касса;
	Движение.Сумма = Сумма;

	Если ВидОперации = Перечисления.УЗ_ВидыОпераций.Приход Тогда
		ТекущийОстаток = ОстатокКассы(Касса);
	КонецЕсли;

	// параметр с именем общего модуля БСП — локальное имя, это не вызов БСП
	ДобавитьПустого(Новый Массив);

	Для Индекс = 1 По Расшифровка.Количество() Цикл
		СтрокаРасшифровки = Расшифровка[Индекс - 1];
		СтрокаРасшифровки.СуммаСтроки = Окр(СтрокаРасшифровки.СуммаСтроки, 2);
	КонецЦикла;

	Текст = "Как в прошлый раз: сумма и касса как и раньше";   // не запрос
	ЗаписьXML = Новый ЗаписьXML;
	НайденныйДокумент = Метаданные.Документы.Найти("УЗ_ПриходДенег");
	ТипСсылки = Тип("ДокументСсылка.УЗ_ПриходДенег");

КонецПроцедуры

Функция ОстатокКассы(КассаОстатка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Касса КАК Касса,
	|	Остатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.УЗ_Касса.Остатки(, Касса = &Касса) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходДенег.Ссылка КАК Ссылка,
	|	ПриходДенег.Сумма КАК Сумма,
	|	ПриходДенег.Касса.Организация КАК Организация,
	|	Пользователи.Наименование КАК Автор
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК ПриходДенег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ПриходДенег.Автор = Пользователи.Ссылка
	|ГДЕ
	|	ПриходДенег.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.Приход)
	|	И ПриходДенег.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расшифровка.Ссылка,
	|	Расшифровка.СуммаСтроки,
	|	NULL,
	|	""""
	|ИЗ
	|	Документ.УЗ_ПриходДенег.Расшифровка КАК Расшифровка";
	Запрос.УстановитьПараметр("Касса", КассаОстатка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Сумма, 0);

КонецФункции

Процедура ДобавитьПустого(Пользователи)
	Пользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
КонецПроцедуры

#КонецЕсли
